/** @typedef {{ id: string, title: string, author: string, content: [string], authorDesc: string, comments: [string], publishedIn: string }} Work

/**
 * @type {[Work]}
 */
const works = [
  {
    id: 'xxzdgy',
    title: '行香子·悼古音',
    author: '荷华',
    content: [
      '古之诗词，以乐配之，以歌而和之，然今之人失其乐，不得奏也。恨古音不闻于吾耳，有感于斯，遂作此。',
      '佳词赏观，喜忧参半。红牙板，素手一端。晓风残月，梦回柳岸。闻一弦清，二弦泣，三弦乱。',
      '旧时名苑，谁家颓垣？铁绰板，锈迹如斑。石破天惊，古今一叹。而余音长，流音散，古音断。'
    ],
    authorDesc:
      '荷华：何梦妮，本网站作者。笔名取自《诗经·郑风·山有扶苏》“山有扶苏，隰有荷华”。 国学诗文曲艺爱好者，外行为之一乐，抒情达意，不求甚解。',
    comments: [
      '行香子：词牌名，又名“爇心香”“读书引”。本词参照苏轼《行香子·述怀》为正体。\n《行香子·述怀》：\n清夜无尘，月色如银。酒斟时、须满十分。浮名浮利，虚苦劳神。叹隙中驹，石中火，梦中身。\n虽抱文章，开口谁亲。且陶陶、乐尽天真。几时归去，作个闲人。对一张琴，一壶酒，一溪云。',
      '红牙板，铁绰板：东坡在玉堂日，有幕士善歌，因问：“我词何如柳七？”对曰：“柳郎中词，只合十七八女郎，执红牙板，歌‘杨柳岸，晓风残月’。学士词，须关西大汉，铜琵琶，铁绰板，唱‘大江东去’。”东坡为之绝倒。——俞文豹',
      '石破天惊：引李贺《李凭箜篌引》“女娲炼石补天处，石破天惊逗秋雨”句。'
    ]
  },
  {
    id: 'yd',
    title: '迎旦',
    author: '荷华',
    content: [
      '亮银映皓影，明眸数微星。',
      '小舍酌清酒，林深闻鹤鸣。',
      '笑挥辞旧日，明朝喜相迎。',
      '天涯四海客，共盼此时明。'
    ]
  }
]

export default works
